"%[Any]@ of the following are true" = "%1$[Mikä tahansa]@ seuraavista on totta";
"%[All]@ of the following are true" = "%1$[Kaikki]@ seuraavista ovat totta";

"%[bitrate]@ %[is]@ %@ kbps" = "%1$[Bittinopeus]@ %2$[on]@ %3$@ kb/s";
"%[bitrate]@ %[is not]@ %@ kbps" = "%1$[Bittinopeus]@ %2$[ei ole]@ %3$@ kb/s";
"%[bitrate]@ %[is greater than]@ %@ kbps" = "%1$[Bittinopeus]@ %2$[on suurempi kuin]@ %3$@ kb/s";
"%[bitrate]@ %[is less than]@ %@ kbps" = "%1$[Bittinopeus]@ %2$[on pienempi kuin]@ %3$@ kb/s";
"%[bitrate]@ %[is in the range]@ %@ to %@ %[kbps]@" = "%1$[Bittinopeus]@ %2$[on välillä]@ %3$@ - %4$@ %5$[kb/s]@";

"%[sample_rate]@ %[is]@ %@ Hz" = "%1$[Näytetaajuus]@ %2$[on]@ %3$@ Hz";
"%[sample_rate]@ %[is not]@ %@ Hz" = "%1$[Näytetaajuus]@ %2$[ei ole]@ %3$@ Hz";
"%[sample_rate]@ %[is greater than]@ %@ Hz" = "%1$[Näytetaajuus]@ %2$[on suurempi kuin]@ %3$@ Hz";
"%[sample_rate]@ %[is less than]@ %@ Hz" = "%1$[Näytetaajuus]@ %2$[on pienempi kuin]@ %3$@ Hz";
"%[sample_rate]@ %[is in the range]@ %@ to %@ %[Hz]@" = "%1$[Näytetaajuus]@ %2$[on välillä]@ %3$@ - %4$@ %5$[Hz]@";

"%[bpm]@ %[is]@ %@" = "%1$[Tempo]@ %2$[on]@ %3$@";
"%[bpm]@ %[is not]@ %@" = "%1$[Tempo]@ %2$[ei ole]@ %3$@";
"%[bpm]@ %[is greater than]@ %@" = "%1$[Tempo]@ %2$[on suurempi kuin]@ %3$@";
"%[bpm]@ %[is less than]@ %@" = "%1$[Tempo]@ %2$[on pienempi kuin]@ %3$@";
"%[bpm]@ %[is in the range]@ %@ to %@" = "%1$[Tempo]@ %2$[on välillä]@ %3$@ - %4$@";

"%[disc_number]@ %[is]@ %@" = "%1$[Levyn numero]@ %2$[on]@ %3$@";
"%[disc_number]@ %[is not]@ %@" = "%1$[Levyn numero]@ %2$[ei ole]@ %3$@";
"%[disc_number]@ %[is greater than]@ %@" = "%1$[Levyn numero]@ %2$[on suurempi kuin]@ %3$@";
"%[disc_number]@ %[is less than]@ %@" = "%1$[Levyn numero]@ %2$[on pienempi kuin]@ %3$@";
"%[disc_number]@ %[is in the range]@ %@ to %@" = "%1$[Levyn numero]@ %2$[on välillä]@ %3$@ - %4$@";

"%[userplaycount]@ %[is]@ %@" = "%1$[Toistokerta]@ %2$[on]@ %3$@";
"%[userplaycount]@ %[is not]@ %@" = "%1$[Toistokerta]@ %2$[ei ole]@ %3$@";
"%[userplaycount]@ %[is greater than]@ %@" = "%1$[Toistokerta]@ %2$[on suurempi kuin]@ %3$@";
"%[userplaycount]@ %[is less than]@ %@" = "%1$[Toistokerta]@ %2$[on pienempi kuin]@ %3$@";
"%[userplaycount]@ %[is in the range]@ %@ to %@" = "%1$[Toistokerta]@ %2$[on välillä]@ %3$@ - %4$@";

"%[season]@ %[is]@ %@" = "%1$[Kausi]@ %2$[on]@ %3$@";
"%[season]@ %[is not]@ %@" = "%1$[Kausi]@ %2$[ei ole]@ %3$@";
"%[season]@ %[is greater than]@ %@" = "%1$[Kausi]@ %2$[on suurempi kuin]@ %3$@";
"%[season]@ %[is less than]@ %@" = "%1$[Kausi]@ %2$[on pienempi kuin]@ %3$@";
"%[season]@ %[is in the range]@ %@ to %@" = "%1$[Kausi]@ %2$[on välillä]@ %3$@ - %4$@";

"%[userskipcount]@ %[is]@ %@" = "%1$[Ohituskerta]@ %2$[on]@ %3$@";
"%[userskipcount]@ %[is not]@ %@" = "%1$[Ohituskerta]@ %2$[ei ole]@ %3$@";
"%[userskipcount]@ %[is greater than]@ %@" = "%1$[Ohituskerta]@ %2$[on suurempi kuin]@ %3$@";
"%[userskipcount]@ %[is less than]@ %@" = "%1$[Ohituskerta]@ %2$[on pienempi kuin]@ %3$@";
"%[userskipcount]@ %[is in the range]@ %@ to %@" = "%1$[Ohituskerta]@ %2$[on välillä]@ %3$@ - %4$@";

"%[track_number]@ %[is]@ %@" = "%1$[Raidan numero]@ %2$[on]@ %3$@";
"%[track_number]@ %[is not]@ %@" = "%1$[Raidan numero]@ %2$[ei ole]@ %3$@";
"%[track_number]@ %[is greater than]@ %@" = "%1$[Raidan numero]@ %2$[on suurempi kuin]@ %3$@";
"%[track_number]@ %[is less than]@ %@" = "%1$[Raidan numero]@ %2$[on pienempi kuin]@ %3$@";
"%[track_number]@ %[is in the range]@ %@ to %@" = "%1$[Raidan numero]@ %2$[on välillä]@ %3$@ - %4$@";

"%[year]@ %[is]@ %@" = "%1$[Vuosi]@ %2$[on]@ %3$@";
"%[year]@ %[is not]@ %@" = "%1$[Vuosi]@ %2$[ei ole]@ %3$@";
"%[year]@ %[is greater than]@ %@" = "%1$[Vuosi]@ %2$[on suurempi kuin]@ %3$@";
"%[year]@ %[is less than]@ %@" = "%1$[Vuosi]@ %2$[on pienempi kuin]@ %3$@";
"%[year]@ %[is in the range]@ %@ to %@" = "%1$[Vuosi]@ %2$[on välillä]@ %3$@ - %4$@";

"%[totalsize]@ %[is]@ %@ MB" = "%1$[Koko]@ %2$[on]@ %3$@ Mt";
"%[totalsize]@ %[is not]@ %@ MB" = "%1$[Koko]@ %2$[ei ole]@ %3$@ Mt";
"%[totalsize]@ %[is greater than]@ %@ MB" = "%1$[Koko]@ %2$[on suurempi kuin]@ %3$@ Mt";
"%[totalsize]@ %[is less than]@ %@ MB" = "%1$[Koko]@ %2$[on pienempi kuin]@ %3$@ Mt";
"%[totalsize]@ %[is in the range]@ %@ to %@ %[MB]@" = "%1$[Koko]@ %2$[on välillä]@ %3$@ - %4$@ %5$[Mt]@";

"%[album]@ %[contains]@ %@" = "%1$[Albumi]@ %2$[sisältää]@ %3$@";
"%[album]@ %[does not contain]@ %@" = "%1$[Albumi]@ %2$[ei sisällä]@ %3$@";
"%[album]@ %[is]@ %@" = "%1$[Albumi]@ %2$[on]@ %3$@";
"%[album]@ %[is not]@ %@" = "%1$[Albumi]@ %2$[ei ole]@ %3$@";
"%[album]@ %[begins with]@ %@" = "%1$[Albumi]@ %2$[alkaa]@ %3$@";
"%[album]@ %[ends with]@ %@" = "%1$[Albumi]@ %2$[loppuu]@ %3$@";

"%[album_artist]@ %[contains]@ %@" = "%1$[Albumin artisti]@ %2$[sisältää]@ %3$@";
"%[album_artist]@ %[does not contain]@ %@" = "%1$[Albumin artisti]@ %2$[ei sisällä]@ %3$@";
"%[album_artist]@ %[is]@ %@" = "%1$[Albumin artisti]@ %2$[on]@ %3$@";
"%[album_artist]@ %[is not]@ %@" = "%1$[Albumin artisti]@ %2$[ei ole]@ %3$@";
"%[album_artist]@ %[begins with]@ %@" = "%1$[Albumin artisti]@ %2$[alkaa]@ %3$@";
"%[album_artist]@ %[ends with]@ %@" = "%1$[Albumin artisti]@ %2$[loppuu]@ %3$@";

"%[artist]@ %[contains]@ %@" = "%1$[Artisti]@ %2$[sisältää]@ %3$@";
"%[artist]@ %[does not contain]@ %@" = "%1$[Artisti]@ %2$[ei sisällä]@ %3$@";
"%[artist]@ %[is]@ %@" = "%1$[Artisti]@ %2$[on]@ %3$@";
"%[artist]@ %[is not]@ %@" = "%1$[Artisti]@ %2$[ei ole]@ %3$@";
"%[artist]@ %[begins with]@ %@" = "%1$[Artisti]@ %2$[alkaa]@ %3$@";
"%[artist]@ %[ends with]@ %@" = "%1$[Artisti]@ %2$[loppuu]@ %3$@";

"%[category]@ %[contains]@ %@" = "%1$[Kategoria]@ %2$[sisältää]@ %3$@";
"%[category]@ %[does not contain]@ %@" = "%1$[Kategoria]@ %2$[ei sisällä]@ %3$@";
"%[category]@ %[is]@ %@" = "%1$[Kategoria]@ %2$[on]@ %3$@";
"%[category]@ %[is not]@ %@" = "%1$[Kategoria]@ %2$[ei ole]@ %3$@";
"%[category]@ %[begins with]@ %@" = "%1$[Kategoria]@ %2$[alkaa]@ %3$@";
"%[category]@ %[ends with]@ %@" = "%1$[Kategoria]@ %2$[loppuu]@ %3$@";

"%[comments]@ %[contains]@ %@" = "%1$[Kommentti]@ %2$[sisältää]@ %3$@";
"%[comments]@ %[does not contain]@ %@" = "%1$[Kommentti]@ %2$[ei sisällä]@ %3$@";
"%[comments]@ %[is]@ %@" = "%1$[Kommentti]@ %2$[on]@ %3$@";
"%[comments]@ %[is not]@ %@" = "%1$[Kommentti]@ %2$[ei ole]@ %3$@";
"%[comments]@ %[begins with]@ %@" = "%1$[Kommentti]@ %2$[alkaa]@ %3$@";
"%[comments]@ %[ends with]@ %@" = "%1$[Kommentti]@ %2$[loppuu]@ %3$@";

"%[composer]@ %[contains]@ %@" = "%1$[Säveltäjä]@ %2$[sisältää]@ %3$@";
"%[composer]@ %[does not contain]@ %@" = "%1$[Säveltäjä]@ %2$[ei sisällä]@ %3$@";
"%[composer]@ %[is]@ %@" = "%1$[Säveltäjä]@ %2$[on]@ %3$@";
"%[composer]@ %[is not]@ %@" = "%1$[Säveltäjä]@ %2$[ei ole]@ %3$@";
"%[composer]@ %[begins with]@ %@" = "%1$[Säveltäjä]@ %2$[alkaa]@ %3$@";
"%[composer]@ %[ends with]@ %@" = "%1$[Säveltäjä]@ %2$[loppuu]@ %3$@";

"%[debug]@ %[contains]@ %@" = "%1$[Vianmääritys]@ %2$[sisältää]@ %3$@";
"%[debug]@ %[does not contain]@ %@" = "%1$[Vianmääritys]@ %2$[ei sisällä]@ %3$@";
"%[debug]@ %[is]@ %@" = "%1$[Vianmääritys]@ %2$[on]@ %3$@";
"%[debug]@ %[is not]@ %@" = "%1$[Vianmääritys]@ %2$[ei ole]@ %3$@";
"%[debug]@ %[begins with]@ %@" = "%1$[Vianmääritys]@ %2$[alkaa]@ %3$@";
"%[debug]@ %[ends with]@ %@" = "%1$[Vianmääritys]@ %2$[loppuu]@ %3$@";

"%[description]@ %[contains]@ %@" = "%1$[Kuvaus]@ %2$[sisältää]@ %3$@";
"%[description]@ %[does not contain]@ %@" = "%1$[Kuvaus]@ %2$[ei sisällä]@ %3$@";
"%[description]@ %[is]@ %@" = "%1$[Kuvaus]@ %2$[on]@ %3$@";
"%[description]@ %[is not]@ %@" = "%1$[Kuvaus]@ %2$[ei ole]@ %3$@";
"%[description]@ %[begins with]@ %@" = "%1$[Kuvaus]@ %2$[alkaa]@ %3$@";
"%[description]@ %[ends with]@ %@" = "%1$[Kuvaus]@ %2$[loppuu]@ %3$@";

"%[genre]@ %[contains]@ %@" = "%1$[Lajityyppi]@ %2$[sisältää]@ %3$@";
"%[genre]@ %[does not contain]@ %@" = "%1$[Lajityyppi]@ %2$[ei sisällä]@ %3$@";
"%[genre]@ %[is]@ %@" = "%1$[Lajityyppi]@ %2$[on]@ %3$@";
"%[genre]@ %[is not]@ %@" = "%1$[Lajityyppi]@ %2$[ei ole]@ %3$@";
"%[genre]@ %[begins with]@ %@" = "%1$[Lajityyppi]@ %2$[alkaa]@ %3$@";
"%[genre]@ %[ends with]@ %@" = "%1$[Lajityyppi]@ %2$[loppuu]@ %3$@";

"%[grouping]@ %[contains]@ %@" = "%1$[Ryhmitys]@ %2$[sisältää]@ %3$@";
"%[grouping]@ %[does not contain]@ %@" = "%1$[Ryhmitys]@ %2$[ei sisällä]@ %3$@";
"%[grouping]@ %[is]@ %@" = "%1$[Ryhmitys]@ %2$[on]@ %3$@";
"%[grouping]@ %[is not]@ %@" = "%1$[Ryhmitys]@ %2$[ei ole]@ %3$@";
"%[grouping]@ %[begins with]@ %@" = "%1$[Ryhmitys]@ %2$[alkaa]@ %3$@";
"%[grouping]@ %[ends with]@ %@" = "%1$[Ryhmitys]@ %2$[loppuu]@ %3$@";

"%[kind]@ %[contains]@ %@" = "%1$[Laji]@ %2$[sisältää]@ %3$@";
"%[kind]@ %[does not contain]@ %@" = "%1$[Laji]@ %2$[ei sisällä]@ %3$@";
"%[kind]@ %[is]@ %@" = "%1$[Laji]@ %2$[on]@ %3$@";
"%[kind]@ %[is not]@ %@" = "%1$[Laji]@ %2$[ei ole]@ %3$@";
"%[kind]@ %[begins with]@ %@" = "%1$[Laji]@ %2$[alkaa]@ %3$@";
"%[kind]@ %[ends with]@ %@" = "%1$[Laji]@ %2$[loppuu]@ %3$@";

"%[name]@ %[contains]@ %@" = "%1$[Nimi]@ %2$[sisältää]@ %3$@";
"%[name]@ %[does not contain]@ %@" = "%1$[Nimi]@ %2$[ei sisällä]@ %3$@";
"%[name]@ %[is]@ %@" = "%1$[Nimi]@ %2$[on]@ %3$@";
"%[name]@ %[is not]@ %@" = "%1$[Nimi]@ %2$[ei ole]@ %3$@";
"%[name]@ %[begins with]@ %@" = "%1$[Nimi]@ %2$[alkaa]@ %3$@";
"%[name]@ %[ends with]@ %@" = "%1$[Nimi]@ %2$[loppuu]@ %3$@";

"%[series_name]@ %[contains]@ %@" = "%1$[Ohjelma]@ %2$[sisältää]@ %3$@";
"%[series_name]@ %[does not contain]@ %@" = "%1$[Ohjelma]@ %2$[ei sisällä]@ %3$@";
"%[series_name]@ %[is]@ %@" = "%1$[Ohjelma]@ %2$[on]@ %3$@";
"%[series_name]@ %[is not]@ %@" = "%1$[Ohjelma]@ %2$[ei ole]@ %3$@";
"%[series_name]@ %[begins with]@ %@" = "%1$[Ohjelma]@ %2$[alkaa]@ %3$@";
"%[series_name]@ %[ends with]@ %@" = "%1$[Ohjelma]@ %2$[loppuu]@ %3$@";

"%[sort_album]@ %[contains]@ %@" = "%1$[Järjestä albumi]@ %2$[sisältää]@ %3$@";
"%[sort_album]@ %[does not contain]@ %@" = "%1$[Järjestä albumi]@ %2$[ei sisällä]@ %3$@";
"%[sort_album]@ %[is]@ %@" = "%1$[Järjestä albumi]@ %2$[on]@ %3$@";
"%[sort_album]@ %[is not]@ %@" = "%1$[Järjestä albumi]@ %2$[ei ole]@ %3$@";
"%[sort_album]@ %[begins with]@ %@" = "%1$[Järjestä albumi]@ %2$[alkaa]@ %3$@";
"%[sort_album]@ %[ends with]@ %@" = "%1$[Järjestä albumi]@ %2$[loppuu]@ %3$@";

"%[sort_album_artist]@ %[contains]@ %@" = "%1$[Järjestä albumin artisti]@ %2$[sisältää]@ %3$@";
"%[sort_album_artist]@ %[does not contain]@ %@" = "%1$[Järjestä albumin artisti]@ %2$[ei sisällä]@ %3$@";
"%[sort_album_artist]@ %[is]@ %@" = "%1$[Järjestä albumin artisti]@ %2$[on]@ %3$@";
"%[sort_album_artist]@ %[is not]@ %@" = "%1$[Järjestä albumin artisti]@ %2$[ei ole]@ %3$@";
"%[sort_album_artist]@ %[begins with]@ %@" = "%1$[Järjestä albumin artisti]@ %2$[alkaa]@ %3$@";
"%[sort_album_artist]@ %[ends with]@ %@" = "%1$[Järjestä albumin artisti]@ %2$[loppuu]@ %3$@";

"%[sort_artist]@ %[contains]@ %@" = "%1$[Järjestä artisti]@ %2$[sisältää]@ %3$@";
"%[sort_artist]@ %[does not contain]@ %@" = "%1$[Järjestä artisti]@ %2$[ei sisällä]@ %3$@";
"%[sort_artist]@ %[is]@ %@" = "%1$[Järjestä artisti]@ %2$[on]@ %3$@";
"%[sort_artist]@ %[is not]@ %@" = "%1$[Järjestä artisti]@ %2$[ei ole]@ %3$@";
"%[sort_artist]@ %[begins with]@ %@" = "%1$[Järjestä artisti]@ %2$[alkaa]@ %3$@";
"%[sort_artist]@ %[ends with]@ %@" = "%1$[Järjestä artisti]@ %2$[loppuu]@ %3$@";

"%[sort_composer]@ %[contains]@ %@" = "%1$[Järjestä säveltäjä]@ %2$[sisältää]@ %3$@";
"%[sort_composer]@ %[does not contain]@ %@" = "%1$[Järjestä säveltäjä]@ %2$[ei sisällä]@ %3$@";
"%[sort_composer]@ %[is]@ %@" = "%1$[Järjestä säveltäjä]@ %2$[on]@ %3$@";
"%[sort_composer]@ %[is not]@ %@" = "%1$[Järjestä säveltäjä]@ %2$[ei ole]@ %3$@";
"%[sort_composer]@ %[begins with]@ %@" = "%1$[Järjestä säveltäjä]@ %2$[alkaa]@ %3$@";
"%[sort_composer]@ %[ends with]@ %@" = "%1$[Järjestä säveltäjä]@ %2$[loppuu]@ %3$@";

"%[sort_name]@ %[contains]@ %@" = "%1$[Järjestä nimi]@ %2$[sisältää]@ %3$@";
"%[sort_name]@ %[does not contain]@ %@" = "%1$[Järjestä nimi]@ %2$[ei sisällä]@ %3$@";
"%[sort_name]@ %[is]@ %@" = "%1$[Järjestä nimi]@ %2$[on]@ %3$@";
"%[sort_name]@ %[is not]@ %@" = "%1$[Järjestä nimi]@ %2$[ei ole]@ %3$@";
"%[sort_name]@ %[begins with]@ %@" = "%1$[Järjestä nimi]@ %2$[alkaa]@ %3$@";
"%[sort_name]@ %[ends with]@ %@" = "%1$[Järjestä nimi]@ %2$[loppuu]@ %3$@";

"%[sort_series_name]@ %[contains]@ %@" = "%1$[Järjestä ohjelma]@ %2$[sisältää]@ %3$@";
"%[sort_series_name]@ %[does not contain]@ %@" = "%1$[Järjestä ohjelma]@ %2$[ei sisällä]@ %3$@";
"%[sort_series_name]@ %[is]@ %@" = "%1$[Järjestä ohjelma]@ %2$[on]@ %3$@";
"%[sort_series_name]@ %[is not]@ %@" = "%1$[Järjestä ohjelma]@ %2$[ei ole]@ %3$@";
"%[sort_series_name]@ %[begins with]@ %@" = "%1$[Järjestä ohjelma]@ %2$[alkaa]@ %3$@";
"%[sort_series_name]@ %[ends with]@ %@" = "%1$[Järjestä ohjelma]@ %2$[loppuu]@ %3$@";

"%[date_added]@ %[is]@ %@" = "%1$[Lisäyspäivä]@ %2$[on]@ %3$@";
"%[date_added]@ %[is not]@ %@" = "%1$[Lisäyspäivä]@ %2$[ei ole]@ %3$@";
"%[date_added]@ %[is greater than]@ %@" = "%1$[Lisäyspäivä]@ %2$[on jälkeen]@ %3$@";
"%[date_added]@ %[is less than]@ %@" = "%1$[Lisäyspäivä]@ %2$[on ennen]@ %3$@";
"%[date_added]@ %[in the last]@ %@ %[days]@" = "%1$[Lisäyspäivä]@ %2$[on viimeksi kuluneen]@ %3$@ %4$[päivän aikana]@";
"%[date_added]@ %[in the last]@ %@ %[weeks]@" = "%1$[Lisäyspäivä]@ %2$[on viimeksi kuluneen]@ %3$@ %4$[viikon aikana]@";
"%[date_added]@ %[in the last]@ %@ %[months]@" = "%1$[Lisäyspäivä]@ %2$[on viimeksi kuluneen]@ %3$@ %4$[kuukauden aikana]@";
"%[date_added]@ %[not in the last]@ %@ %[days]@" = "%1$[Lisäyspäivä]@ %2$[ei ole viimeksi kuluneen]@ %3$@ %4$[päivän aikana]@";
"%[date_added]@ %[not in the last]@ %@ %[weeks]@" = "%1$[Lisäyspäivä]@ %2$[ei ole viimeksi kuluneen]@ %3$@ %4$[viikon aikana]@";
"%[date_added]@ %[not in the last]@ %@ %[months]@" = "%1$[Lisäyspäivä]@ %2$[ei ole viimeksi kuluneen]@ %3$@ %4$[kuukauden aikana]@";
"%[date_added]@ %[is in the range]@ %@ to %@" = "%1$[Lisäyspäivä]@ %2$[on välillä]@ %3$@ - %4$@";

"%[date_modified]@ %[is]@ %@" = "%1$[Muokkauspäivä]@ %2$[on]@ %3$@";
"%[date_modified]@ %[is not]@ %@" = "%1$[Muokkauspäivä]@ %2$[ei ole]@ %3$@";
"%[date_modified]@ %[is greater than]@ %@" = "%1$[Muokkauspäivä]@ %2$[on jälkeen]@ %3$@";
"%[date_modified]@ %[is less than]@ %@" = "%1$[Muokkauspäivä]@ %2$[on ennen]@ %3$@";
"%[date_modified]@ %[in the last]@ %@ %[days]@" = "%1$[Muokkauspäivä]@ %2$[on viimeksi kuluneen]@ %3$@ %4$[päivän aikana]@";
"%[date_modified]@ %[in the last]@ %@ %[weeks]@" = "%1$[Muokkauspäivä]@ %2$[on viimeksi kuluneen]@ %3$@ %4$[viikon aikana]@";
"%[date_modified]@ %[in the last]@ %@ %[months]@" = "%1$[Muokkauspäivä]@ %2$[on viimeksi kuluneen]@ %3$@ %4$[kuukauden aikana]@";
"%[date_modified]@ %[not in the last]@ %@ %[days]@" = "%1$[Muokkauspäivä]@ %2$[ei ole viimeksi kuluneen]@ %3$@ %4$[päivän aikana]@";
"%[date_modified]@ %[not in the last]@ %@ %[weeks]@" = "%1$[Muokkauspäivä]@ %2$[ei ole viimeksi kuluneen]@ %3$@ %4$[viikon aikana]@";
"%[date_modified]@ %[not in the last]@ %@ %[months]@" = "%1$[Muokkauspäivä]@ %2$[ei ole viimeksi kuluneen]@ %3$@ %4$[kuukauden aikana]@";
"%[date_modified]@ %[is in the range]@ %@ to %@" = "%1$[Muokkauspäivä]@ %2$[on välillä]@ %3$@ - %4$@";

"%[playdate]@ %[is]@ %@" = "%1$[Viimeisin toistopäivä]@ %2$[on]@ %3$@";
"%[playdate]@ %[is not]@ %@" = "%1$[Viimeisin toistopäivä]@ %2$[ei ole]@ %3$@";
"%[playdate]@ %[is greater than]@ %@" = "%1$[Viimeisin toistopäivä]@ %2$[on jälkeen]@ %3$@";
"%[playdate]@ %[is less than]@ %@" = "%1$[Viimeisin toistopäivä]@ %2$[on ennen]@ %3$@";
"%[playdate]@ %[in the last]@ %@ %[days]@" = "%1$[Viimeisin toistopäivä]@ %2$[on viimeksi kuluneen]@ %3$@ %4$[päivän aikana]@";
"%[playdate]@ %[in the last]@ %@ %[weeks]@" = "%1$[Viimeisin toistopäivä]@ %2$[on viimeksi kuluneen]@ %3$@ %4$[viikon aikana]@";
"%[playdate]@ %[in the last]@ %@ %[months]@" = "%1$[Viimeisin toistopäivä]@ %2$[on viimeksi kuluneen]@ %3$@ %4$[kuukauden aikana]@";
"%[playdate]@ %[not in the last]@ %@ %[days]@" = "%1$[Viimeisin toistopäivä]@ %2$[ei ole viimeksi kuluneen]@ %3$@ %4$[päivän aikana]@";
"%[playdate]@ %[not in the last]@ %@ %[weeks]@" = "%1$[Viimeisin toistopäivä]@ %2$[ei ole viimeksi kuluneen]@ %3$@ %4$[viikon aikana]@";
"%[playdate]@ %[not in the last]@ %@ %[months]@" = "%1$[Viimeisin toistopäivä]@ %2$[ei ole viimeksi kuluneen]@ %3$@ %4$[kuukauden aikana]@";
"%[playdate]@ %[is in the range]@ %@ to %@" = "%1$[Viimeisin toistopäivä]@ %2$[on välillä]@ %3$@ - %4$@";

"%[skipdate]@ %[is]@ %@" = "%1$[Viimeisin ohituspäivä]@ %2$[on]@ %3$@";
"%[skipdate]@ %[is not]@ %@" = "%1$[Viimeisin ohituspäivä]@ %2$[ei ole]@ %3$@";
"%[skipdate]@ %[is greater than]@ %@" = "%1$[Viimeisin ohituspäivä]@ %2$[on jälkeen]@ %3$@";
"%[skipdate]@ %[is less than]@ %@" = "%1$[Viimeisin ohituspäivä]@ %2$[on ennen]@ %3$@";
"%[skipdate]@ %[in the last]@ %@ %[days]@" = "%1$[Viimeisin ohituspäivä]@ %2$[on viimeksi kuluneen]@ %3$@ %4$[päivän aikana]@";
"%[skipdate]@ %[in the last]@ %@ %[weeks]@" = "%1$[Viimeisin ohituspäivä]@ %2$[on viimeksi kuluneen]@ %3$@ %4$[viikon aikana]@";
"%[skipdate]@ %[in the last]@ %@ %[months]@" = "%1$[Viimeisin ohituspäivä]@ %2$[on viimeksi kuluneen]@ %3$@ %4$[kuukauden aikana]@";
"%[skipdate]@ %[not in the last]@ %@ %[days]@" = "%1$[Viimeisin ohituspäivä]@ %2$[ei ole viimeksi kuluneen]@ %3$@ %4$[päivän aikana]@";
"%[skipdate]@ %[not in the last]@ %@ %[weeks]@" = "%1$[Viimeisin ohituspäivä]@ %2$[ei ole viimeksi kuluneen]@ %3$@ %4$[viikon aikana]@";
"%[skipdate]@ %[not in the last]@ %@ %[months]@" = "%1$[Viimeisin ohituspäivä]@ %2$[ei ole viimeksi kuluneen]@ %3$@ %4$[kuukauden aikana]@";
"%[skipdate]@ %[is in the range]@ %@ to %@" = "%1$[Viimeisin ohituspäivä]@ %2$[on välillä]@ %3$@ - %4$@";

"%[songid]@ %[is]@" = "%1$[Ostettu]@ %2$[on tosi]@";
"%[songid]@ %[is not]@" = "%1$[Ostettu]@ %2$[on epätosi]@";

"%[olduserdisabled]@ %[is]@" = "%1$[Valittu]@ %2$[on tosi]@";
"%[olduserdisabled]@ %[is not]@" = "%1$[Valittu]@ %2$[on epätosi]@";

"%[artwork]@ %[is]@" = "%1$[Albumikuvitus]@ %2$[on tosi]@";
"%[artwork]@ %[is not]@" = "%1$[Albumikuvitus]@ %2$[on epätosi]@";

"%[compilation]@ %[is]@" = "%1$[Kokoelma]@ %2$[on tosi]@";
"%[compilation]@ %[is not]@" = "%1$[Kokoelma]@ %2$[on epätosi]@";

"%[totaltime]@ %[is]@ %@" = "%1$[Aika]@ %2$[on]@ %3$@";
"%[totaltime]@ %[is not]@ %@" = "%1$[Aika]@ %2$[ei ole]@ %3$@";
"%[totaltime]@ %[is greater than]@ %@" = "%1$[Aika]@ %2$[on suurempi kuin]@ %3$@";
"%[totaltime]@ %[is less than]@ %@" = "%1$[Aika]@ %2$[on pienempi kuin]@ %3$@";
"%[totaltime]@ %[is in the range]@ %@ to %@" = "%1$[Aika]@ %2$[on välillä]@ %3$@ - %4$@";

"%[albumrating]@ %[is]@ %@" = "%1$[Albumin arviointi]@ %2$[on]@ %3$@";
"%[albumrating]@ %[is not]@ %@" = "%1$[Albumin arviointi]@ %2$[ei ole]@ %3$@";
"%[albumrating]@ %[is greater than]@ %@" = "%1$[Albumin arviointi]@ %2$[on suurempi kuin]@ %3$@";
"%[albumrating]@ %[is less than]@ %@" = "%1$[Albumin arviointi]@ %2$[on pienempi kuin]@ %3$@";
"%[albumrating]@ %[is in the range]@ %@ to %@" = "%1$[Albumin arviointi]@ %2$[on välillä]@ %3$@ - %4$@";

"%[trackrating]@ %[is]@ %@" = "%1$[Arviointi]@ %2$[on]@ %3$@";
"%[trackrating]@ %[is not]@ %@" = "%1$[Arviointi]@ %2$[ei ole]@ %3$@";
"%[trackrating]@ %[is greater than]@ %@" = "%1$[Arviointi]@ %2$[on suurempi kuin]@ %3$@";
"%[trackrating]@ %[is less than]@ %@" = "%1$[Arviointi]@ %2$[on pienempi kuin]@ %3$@";
"%[trackrating]@ %[is in the range]@ %@ to %@" = "%1$[Arviointi]@ %2$[on välillä]@ %3$@ - %4$@";

"%[mediakind]@ %[is]@ %[Music]@" = "%1$[Medialaji]@ %2$[on]@ %3$[musiikki]@";
"%[mediakind]@ %[is]@ %[Music Video]@" = "%1$[Medialaji]@ %2$[on]@ %3$[musiikkivideo]@";
"%[mediakind]@ %[is]@ %[Movie]@" = "%1$[Medialaji]@ %2$[on]@ %3$[elokuva]@";
"%[mediakind]@ %[is]@ %[TV Show]@" = "%1$[Medialaji]@ %2$[on]@ %3$[TV-ohjelma]@";
"%[mediakind]@ %[is]@ %[Podcast]@" = "%1$[Medialaji]@ %2$[on]@ %3$[podcast]@";
"%[mediakind]@ %[is]@ %[iTunes U]@" = "%1$[Medialaji]@ %2$[on]@ %3$[iTunes U]@";
"%[mediakind]@ %[is]@ %[Audiobook]@" = "%1$[Medialaji]@ %2$[on]@ %3$[äänikirja]@";
"%[mediakind]@ %[is]@ %[Book]@" = "%1$[Medialaji]@ %2$[on]@ %3$[kirja]@";
"%[mediakind]@ %[is]@ %[Voice Memo]@" = "%1$[Medialaji]@ %2$[on]@ %3$[sanelu]@";
"%[mediakind]@ %[is]@ %[iTunes Extras]@" = "%1$[Medialaji]@ %2$[on]@ %3$[iTunes Extras]@";
"%[mediakind]@ %[is not]@ %[Music]@" = "%1$[Medialaji]@ %2$[ei ole]@ %3$[musiikki]@";
"%[mediakind]@ %[is not]@ %[Music Video]@" = "%1$[Medialaji]@ %2$[ei ole]@ %3$[musiikkivideo]@";
"%[mediakind]@ %[is not]@ %[Movie]@" = "%1$[Medialaji]@ %2$[ei ole]@ %3$[elokuva]@";
"%[mediakind]@ %[is not]@ %[TV Show]@" = "%1$[Medialaji]@ %2$[ei ole]@ %3$[TV-ohjelma]@";
"%[mediakind]@ %[is not]@ %[Podcast]@" = "%1$[Medialaji]@ %2$[ei ole]@ %3$[podcast]@";
"%[mediakind]@ %[is not]@ %[iTunes U]@" = "%1$[Medialaji]@ %2$[ei ole]@ %3$[iTunes U]@";
"%[mediakind]@ %[is not]@ %[Audiobook]@" = "%1$[Medialaji]@ %2$[ei ole]@ %3$[äänikirja]@";
"%[mediakind]@ %[is not]@ %[Book]@" = "%1$[Medialaji]@ %2$[ei ole]@ %3$[kirja]@";
"%[mediakind]@ %[is not]@ %[Voice Memo]@" = "%1$[Medialaji]@ %2$[ei ole]@ %3$[sanelu]@";
"%[mediakind]@ %[is not]@ %[iTunes Extras]@" = "%1$[Medialaji]@ %2$[ei ole]@ %3$[iTunes Extras]@";

"%[playlistpersistentid]@ %[is]@ %@" = "%1$[Soittolista]@ %2$[on]@ %3$@";
"%[playlistpersistentid]@ %[is not]@ %@" = "%1$[Soittolista]@ %2$[ei ole]@ %3$@";

"%[trackkinds]@ %[is]@ %[local]@" = "%1$[Sijainti]@ %2$[on]@ %3$[tällä tietokoneella]@";
"%[trackkinds]@ %[is]@ %[iCloud]@" = "%1$[Sijainti]@ %2$[on]@ %3$[iCloud]@";
"%[trackkinds]@ %[is not]@ %[local]@" = "%1$[Sijainti]@ %2$[ei ole]@ %3$[tällä tietokoneella]@";
"%[trackkinds]@ %[is not]@ %[iCloud]@" = "%1$[Sijainti]@ %2$[ei ole]@ %3$[iCloud]@";

"%[icloudstatus]@ %[is]@ %[Matched]@" = "%1$[iCloud-tila]@ %2$[on]@ %3$[täsmäävä]@";
"%[icloudstatus]@ %[is]@ %[Purchased]@" = "%1$[iCloud-tila]@ %2$[on]@ %3$[ostettu]@";
"%[icloudstatus]@ %[is]@ %[Uploaded]@" = "%1$[iCloud-tila]@ %2$[on]@ %3$[ladattu]@";
"%[icloudstatus]@ %[is]@ %[Ineligible]@" = "%1$[iCloud-tila]@ %2$[on]@ %3$[soveltumaton]@";
"%[icloudstatus]@ %[is]@ %[Local Only]@" = "%1$[iCloud-tila]@ %2$[on]@ %3$[vain paikallinen]@";
"%[icloudstatus]@ %[is]@ %[Error]@" = "%1$[iCloud-tila]@ %2$[on]@ %3$[virhe]@";
"%[icloudstatus]@ %[is]@ %[Duplicate]@" = "%1$[iCloud-tila]@ %2$[on]@ %3$[kaksoiskappale]@";
"%[icloudstatus]@ %[is not]@ %[Matched]@" = "%1$[iCloud-tila]@ %2$[ei ole]@ %3$[täsmäävä]@";
"%[icloudstatus]@ %[is not]@ %[Purchased]@" = "%1$[iCloud-tila]@ %2$[ei ole]@ %3$[ostettu]@";
"%[icloudstatus]@ %[is not]@ %[Uploaded]@" = "%1$[iCloud-tila]@ %2$[ei ole]@ %3$[ladattu]@";
"%[icloudstatus]@ %[is not]@ %[Ineligible]@" = "%1$[iCloud-tila]@ %2$[ei ole]@ %3$[soveltumaton]@";
"%[icloudstatus]@ %[is not]@ %[Local Only]@" = "%1$[iCloud-tila]@ %2$[ei ole]@ %3$[vain paikallinen]@";
"%[icloudstatus]@ %[is not]@ %[Error]@" = "%1$[iCloud-tila]@ %2$[ei ole]@ %3$[virhe]@";
"%[icloudstatus]@ %[is not]@ %[Duplicate]@" = "%1$[iCloud-tila]@ %2$[ei ole]@ %3$[kaksoiskappale]@";
